app/views/account/posts/index.html.erb

          <td><%= post.updated_at.to_s(:short) %></td>
          <td><%= link_to('Edit', edit_group_post_path(post.group, post), class: "btn btn-info btn-xs") %></td>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 2]]