app/views/groups/show.html.erb

            <% if current_user && post.editable_by?(current_user) %>
              <%= link_to("編輯", edit_group_post_path(post.group, post), class: "btn btn-default btn-xs")%>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 2]]